metaneutrons/Vellum/firmware/sdkconfig.defaults
# Vellum Firmware — sdkconfig defaults for E1003
# Target: ESP32-S3

CONFIG_IDF_TARGET="esp32s3"

# Flash / partition
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Panel
CONFIG_VELLUM_PANEL_E1003=y

# NVS
# DEV-ONLY POSTURE: NVS encryption is deliberately OFF in this baseline so dev
# boards stay reflashable over UART. It provides NO at-rest confidentiality for
# the WiFi PSK, device token or X25519 private key — an attacker with physical
# flash access can read them. Production images MUST be built with the hardening
# overlay, which turns this on and backs it with Flash Encryption (Release):
#   make build MODEL=<model> SECURE=1 SECURE_PROFILE=prod
# See firmware/sdkconfig.defaults.prod and docs/SECURE_BOOT_AND_KMS.md. Do not
# ship a field/production image built from this default profile.
CONFIG_NVS_ENCRYPTION=n

# Wi-Fi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# Sleep
CONFIG_PM_SLP_IRAM_OPT=n

# HTTP client
# CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS is not set

# HTTPD (captive portal)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# LVGL
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_MEM_POOL_ALLOC_LARGEST_FREE=y

# Force malloc to prefer PSRAM (LVGL allocations go to PSRAM)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_USE_MALLOC=y

# PSRAM (8MB on reTerminal E-Series)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
